text_1 = input("Введіть ім'я : ")
text_2 = input("Введіть прізвище : ")
text_3 = input("Введіть рік народження : ")
text_4 = input("Введіть зріст : ")
text_5 = input("Введіть вагу : ")

print("Ім'я: ", text_1)
print("Прізвище: ", text_2)
print("Рік народження: ", text_3)
print("Зріст: ", text_4)
print("Вага: ", text_5)

'''
За допомогою функції input() введіть наступну інформацію:
За допомогою функції input() введіть наступну інформацію:
ім'я;
прізвище;
рік народження;
зріст;
вага.

Виведіть інформацію у такому форматі:

	Ім'я: *введене ім'я*
Прізвище: *введене прізвище*
Рік народження: *введений рік*
Зріст: *введений зріст*
Вага: *введена вага*
'''