with open('aaaaaa.txt', 'w', encoding='utf-8') as file:
    file.write("""Садок вишневий коло хати,
Хрущі над вишнями гудуть,
Плугатарі з плугами йдуть,
Співають ідучи дівчата,
А матері вечерять ждуть.
Сім'я вечеря коло хати,
Вечірня зіронька встає.
Дочка вечерять подає,
А мати хоче научати,
Так соловейко не дає.
Поклала мати коло хати
Маленьких діточок своїх;
Сама заснула коло їх.
Затихло все, тілько дівчата
Та соловейко не затих.""")

with open('aaaaaa.txt', 'r', encoding='utf-8') as file:
    text = file.read()

words = text.split()
text_go = len(words)

print(f"Кількість слів у вірші: {text_go}")
