

first_string = input("Введіть перший рядок: ")
second_string = input("Введіть другий рядок: ")

duplicate_first_string = (first_string + ", ") * 4 + first_string
duplicate_second_string = (second_string + "; ") * 2 + second_string

association = duplicate_first_string + "\n" + duplicate_second_string



print(association)





'''
Завдання 1.
Напишіть програму, в яку користувач вводить два рядкових значення, кожне значення
вводиться з нового рядка. Сформуйте новий рядок, в якому Ви повинні:
Продублювати перший рядок 5 раз, розділяючи кожен дублікат комою(‘, ‘);
Продублювати другий рядок 3 рази, розділяючи кожен дублікат крапкою з комою(‘; ‘);
Об’єднати рядки за допомогою знаку переходу на новий рядок(‘\n’).
Виведіть створений рядок в консоль.

'''