first_list = [1,54,12,8,32,654,23,76,23,63]
print("Сума всіх елементів у списку: ",sum(first_list))
print("Найменший елемент у списку: ",min(first_list))
print("Найбільший елемент у списку: ",max(first_list))
average_list = sum(first_list)/len(first_list)
print("Cереднє арифметичне значення: ",average_list)




'''
Створіть список з довільними десятьма числовими значеннями. Ви повинні:
1. Обчисліть суму всіх елементів у списку.
2. Знайдіть найбільший та найменший елементи у списку.
3. Знайдіть середнє арифметичне значення.
Всі результати виведіть в консоль.

'''