age = float(input("Enter your age: "))

if not age % 1 == 0:
    print("Число не є цілим")
else:
    age = int(age)
    if age == str(int(age)):
        print("Помилка введіть ціле числа")
    else:
        if int(age) < 18:
            print(f"Тобі {age} років, ти ще неповнолітній.")
        elif 18 <= int(age) <= 65:
            print(f"Тобі {age} років, ти дорослий.")
        else:
            print(f"Тобі {age} років, Ти пенсіонер")



'''
 Метод isdigit()повертає True, якщо всі символи є цифрами, інакше False.
 https://www.w3schools.com/python/ref_string_isdigit.asp

Завдання 1. 
Напишіть програму, яка запитує користувача його вік. 
Спочатку виконайте перевірку чи введене число є цілим числом, 
виведіть помилку в протилежному випадку. Дальше виконайте наступні перевірки:
якщо вік менше 18 — вивести "Тобі N років, ти ще неповнолітній.";
якщо вік від 18 до 65 — вивести "Тобі N років, ти дорослий.";
якщо вік більше 65 — вивести "Тобі N років, Ти пенсіонер".
'''