num_1 = int(input("Введіть початкове число діапазону: "))
num_2 = int(input("Введіть кінцеве число діапазону: "))

primes = []

for num in range(num_1, num_2 + 1):
    if num > 1:
        is_prime = True
        for i in range(2, int(num ** 0.5) + 1):
            if num % i == 0:
                is_prime = False
                break
        if is_prime:
            primes.append(num)
print(f"Прості числа в діапазоні від {num_1} до {num_2}: {primes}")


'''
Потрібно написати програму, яка знаходить всі прості числа в заданому діапазоні. 
Початкове і кінцеве значення задається користувачем. Після цього програма,
за допомогою циклу, має перевірити всі числа і вивести всі прості числа.
ПРОСТЕ ЧИСЛО – це число, яке ділиться лише на 1 і на самого себе. Приклад роботи програми:
Введіть початкове число діапазону: 10
Введіть кінцеве число діапазону: 30
Прості числа в діапазоні від 10 до 30: 11, 13, 17, 19, 23, 29

'''