import random

secret_num = random.randint(1, 100)
attempts = 5
print("Я загадав випадкове число від 1 до 100 спробуй вгадати його")

for attempt in range(attempts):
    guess = int(input(f"Cпроба {attempt +1 } Введіть ваше число: "))

    if guess > secret_num:
        print("Введене число більше від загадоного")
    elif guess < secret_num:
        print("Введене число менше від загадоного")
    else:
        print(f"Вау ви вгадали загадане число {secret_num} всього за {attempt +1 } спроб")
        break
else:
    print(f"На жаль, ви не вгадали число. Загадане число: {secret_num}.")
'''
Напишіть програму, яка загадує випадкове число від 1 до 100.
Користувачеві надається 5 спроб, щоб вгадати це число.
Після кожної спроби програма повинна повідомляти, чи більше або менше введене число від загаданого.
Використовуйте інтернет-ресурси, для того щоб знайти функцію для отримання випадкового числа в Python.

'''