# Напишіть програму, в яку користувач вводить одне рядкове значення. Ви повинні:
text = input("Введіть рядок: ")

# Вивести перший і останній символ введеного рядка, сформувавши з них один рядок.
first_last = text[0] + text[-1]
print("Перший і останній символ:", first_last)

# Вивести кожен другий символ введеного рядка
every_second = text[1::2]
print("Кожен другий символ:", every_second)

# Вивести перші і останні 4 символи рядка, сформувавши з них один рядок.
first_and_last_4 = text[:4] + text[-4:]
print("Перші і останні 4 символи:", first_and_last_4)

# Вивести всі символи в зворотному порядку.
reversed_string = text[::-1]
print("Рядок у зворотному порядку:", reversed_string)

# Вивести перші 4 символи з рядка, який попередньо сформований в зворотному порядку.
first_4_reversed = reversed_string[:4]
print("Перші 4 символи зі зворотного рядка:", first_4_reversed)


'''
Напишіть програму, в яку користувач вводить одне рядкове значення. Ви повинні:
Вивести перший і останній символ введеного рядка, сформувавши з них один рядок.
Вивести кожен другий символ введеного рядка
Вивести перші і останні 4 символи рядка, сформувавши з них один рядок.
Вивести всі символи в зворотному порядку.
Вивести перші 4 символи з рядка, який попередньо сформований в зворотному порядку.

'''