apples = int(input("Введіть кількість яблук:" ))
student = int(input("Введіть кількість студентів: "))

text_1 = apples // student
text_2 = apples % student

print(student, "студентів отримають по ", text_1, "яблук/a")
print("Залишилось ", text_2, "яблук")





'''

Завдання 2.
	Напишіть програму, яка приймає кількість яблук і кількість студентів у групі, потім обчислює, скільки яблук отримає кожен учень і скільки яблук залишиться після рівного розподілу. 
	В рішенні цього завдання використовуйте підказки в функції input() для кращого вигляду програми в терміналі.
	Підказка: використовуйте оператори цілочисельного ділення та остачі від ділення.

'''