total_score = 0

while True:
    user_input = input("Введіть результат учасника (0-100) або 'finish' для завершення: ")
    if user_input.lower() == 'finish':
        break
    if user_input.isdigit():
        result = int(user_input)
        if 0 <= result <= 100:
            total_score += result
        else:
            print("Помилка: Результат повинен бути в діапазоні від 0 до 100!")
    else:
        print(
            "Помилка: Будь ласка, введіть ціле число або 'finish' для завершення!")

print(f"Загальна сума балів: {total_score}")

'''
Потрібно написати програму, яка використовує безкінечний цикл while,
щоб запитувати користувача про результати спортивного змагання.
 Кожен результат повинен бути цілим числом від 0 до 100. Кожен результат користувач вводить самостійно!
Спочатку програма повинна запитувати користувача про результати
 та перевіряти, чи результат відповідає діапазону(від 0 до 100).
  Якщо результат валідний, то цей результат потрібно додати до загальної суми балів,
   в іншому випадку – вивести повідомлення про помилку. Коли користувач введе «finish»
   - цикл повинен завершити свою роботу та вивести загальну суму балів.

Введіть результат учасника (0-100) або 'finish' для завершення: 75
Введіть результат учасника (0-100) або ' finish' для завершення: 75
Введіть результат учасника (0-100) або ' finish' для завершення: 125
Помилка: Результат повинен бути в діапазоні від 0 до 100!
Введіть результат учасника (0-100) або 'finish' для завершення: finish
Загальна сума балів: 150

'''