first_list = [1,54,12,8,32,654,23,76,23,63]
print("Список у звородному порядку: ",first_list[::-1])
new_list = [143,112,187]
united_list = first_list+new_list
print("Об’єднаний список: ", united_list)
print("Перший елемент у списку: ", first_list.pop(0))
print("Останній елемент у списку: ", first_list.pop())

print("Перший елемент у об’єднаному списку: ", united_list.pop(0))
print("Останній елемент у об’єднаному списку:: ", united_list.pop())



'''
ання 2.
Створіть список з довільними десятьма числовими значеннями. Ви повинні:
1. Виведіть список у зворотному порядку.
2. Створіть новий довільний список і об’єднайте зі старим списком.
3. Виведіть перший і останній елементи списку.
Всі результати виведіть в консоль.
Код:
Консоль:

'''