text = input("Введіть текст: ")

if any(char.isdigit() for char in text):
    print("Слово містить цифри.")

if text.startswith("a"):
    print("Слово починається на 'а'")

if text.endswith("o"):
    print("Слово закінчується на 'о'")

if len(text) > 5:
    print("Слово довге")

if not (any(char.isdigit() for char in text) or text.startswith("a") or text.endswith("o") or len(text) > 5):
    print("Звичайне слово.")



'''
Напишіть програму, в якій користувач вводить любе слово. Якщо в цьому слові містяться цифри 
- виведіть повідомлення про це.
	Також додайте наступні перевірки:
якщо слово починається на букву "а" - вивести "Слово починається на 'а'";
Якщо слово закінчується на букву "о" - вивести "Слово закінчується на 'о'";
Якщо довжина слова більша за 5 символів - вивести "Слово довге".
Якщо жодна умова не виконується, вивести "Звичайне слово".
Код:
Консоль:

'''