yaroslav_total = 0
slavik_total = 0
ivan_total = 0

while True:
    user_input = input("Введіть ім’я кандидата, за якого ви голосуєте (введіть 'стоп' для завершення): ")
    if user_input.lower() == 'стоп':
        break
    elif user_input.lower() == 'yaroslav':
        yaroslav_total += 1
    elif user_input.lower() == 'slavik':
        slavik_total += 1
    elif user_input.lower() == 'ivan':
        ivan_total += 1
    else:
        print("Помилка: Будь ласка, введіть імя кандидата 'yaroslav','slavik','ivan' за кого хочеш проголосувати або 'finish' для завершення!")

print("Результати голосування:")
print(f" Yaroslav: {yaroslav_total} \n Slavik: {slavik_total} \n Ivan: {ivan_total}")


'''


print(f"Загальна сума балів: {total_score}")


Створіть програму, яка підраховує голоси за кандидатів на виборах. Користувач вводить ім’я кандидата, за якого проголосував, і програма підраховує кількість голосів для кожного кандидата. Використовуйте список для зберігання імен кандидатів, цикли для запиту голосів, поки не буде введено “стоп”, після чого виведіть результати голосування.
Приклад роботи програми:
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): Іван
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): Петро
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): Іван
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): Марія
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): Іван
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): Петро
Введіть ім’я кандидата, за якого ви голосуєте (введіть "стоп" для завершення): стоп


Приклад завершення роботи програми:
Результати голосування:
Іван: 3 голоси
Петро: 2 голоси
Марія: 1 голос
'''