countries_info = {
    "Україна": {
        "столиця": "Київ",
        "площа (км²)": 603700,
        "кількість населення": 41000000
    },
    "США": {
        "столиця": "Вашингтон",
        "площа (км²)": 9833517,
        "кількість населення": 331000000
    },
    "Німеччина": {
        "столиця": "Берлін",
        "площа (км²)": 357022,
        "кількість населення": 83783942
    },
    "Франція": {
        "столиця": "Париж",
        "площа (км²)": 551695,
        "кількість населення": 65273511
    },
    "Японія": {
        "столиця": "Токіо",
        "площа (км²)": 377975,
        "кількість населення": 126476461
    }
}


for country, info in countries_info.items():
    print(f"Країна: {country}")
    print(f"  Столиця: {info['столиця']}")
    print(f"  Площа: {info['площа (км²)']} км²")
    print(f"  Кількість населення: {info['кількість населення']}")
    print()

'''
Створити словник з країнами та її характеристиками. 
Ключем є назва країни, а значення в форматі словника з такими ключами:
столиця країна;
площа країни;
кількість населення;
Словник повинен містити інформацію мінімум про 5 країн.

'''