lastname = input("Ваше прізвище: ")
grades_count = int(input("Кількість оцінок: "))
positive_grades_count = int(input("Кількість позитивних оцінок: "))

info_list = [lastname, grades_count, positive_grades_count]

print(info_list)


'''
Вводиться інформація щодо обліку(кожне значення з нового рядка):
1. Ваше прізвище(рядкове значення).
2. Кількість оцінок(ціле число).
3. Кількість позитивних оцінок(ціле число)	
На основі цих даних формується список в порядку їх введення. Виведіть цей список в консоль.

'''