"""
Напишіть функцію descending_order, яка може приймати в якості аргументу будь-яке
 невід'ємне ціле число і повертати його цифрами у порядку спадання. По суті, переставити
  цифри так, щоб отримати максимально можливе число.
Перевірте, чи переданий аргумент є цілим і невідʼмним числом та виведіть помилку, якщо
 переданий аргумент не відповідає вказаним вимогам.
"""


def descending_order(num):
    if not isinstance(num, int) or num < 0:
        return "Аргумент повинен бути невід'ємним цілим числом."

    return " ".join(str(x) for x in range(num, 0, -1))


while True:
    user_input = input("Введіть невід'ємне ціле число: ")

    try:
        num = int(user_input)
        if num < 0:
            print("Число повинно бути невід'ємним.")
        else:
            break
    except ValueError:
        print("Аргумент повинен бути цілим числом.")

result_num = descending_order(num)
print(f"Максимальне можливе число: {result_num}")
