from super_list import find_max, find_min, average, remove_duplicates, reverse_list, filter_even

lst = [5, 2, 8, 3, 1, 2, 7, 6, 10, 'g']


print(find_max(lst))
print(find_min(lst))
print(average(lst))
print(remove_duplicates(lst))
print(reverse_list(lst))
print(filter_even(lst))

'''
Створіть власний модуль для роботи зі списками super_list. Модуль - це просто файл із розширенням .py, який містить функції,
 класи або змінні. 
Ваш модуль повинен містити функції, які виконують різні операції над списками. Потім створіть окремий файл,
 у якому імпортуєте цей модуль і перевірте роботу його функцій.
Він має містити такі функції:
find_max(lst): Знаходить максимальний елемент у списку. Виконати без використання функції max().
find_min(lst): Знаходить мінімальний елемент у списку. Виконати без використання функції min().
average(lst): Обчислює середнє значення елементів у списку. Якщо список складається з рядків - вивести помилку.
remove_duplicates(lst): Видаляє дублікати зі списку але не змінює його тип даних.
reverse_list(lst): Повертає список у зворотному порядку.
filter_even(lst): Повертає новий список, що містить тільки парні числа.

'''