number = float(input("Enter a number: "))

if not number % 1 == 0:
    print("Число не є цілим")
else:
    if int(number) % 2 == 0:
        print("Число парне.")

    if int(number) % 2 != 0:
        print("Число не парне")

    if int(number) > 100:
        print("Число більше за 100")

    if int(number) < 0:
        print("Число відʼємне")

    if int(number) == 0:
        print("Число дорівнює нулю")

'''
Напишіть програму, в якій користувач вводить число. 
Спочатку виконайте перевірку, чи введене число є цілим числом, виведіть помилку в протилежному випадку. 
Дальше виконайте наступні перевірки до цього числа:
Якщо число парне — вивести "Число парне".
Якщо число непарне — вивести "Число непарне".
Якщо число більше за 100 — вивести "Число більше за 100".
Якщо число відʼємне — вивести "Число відʼємне".
Якщо число 0 — вивести "Число дорівнює нулю".
'''