length = int(input("Введіть довжину прямокутника: "))
width = int(input("Введіть ширину прямокутника: "))

perimeter = int(length+length)+(width+width)
print("Периметр прямокутника:",perimeter)

'''
Завдання 3.
Напишіть програму для обчислення периметра прямокутника.
Створіть змінні для збереження введених користувачем довжини і ширини прямокутника.
В результаті роботи програма повинна виводити в консоль периметр прямокутника по заданим значенням.
Використовуйте функцію input() для отримання введених значень від користувача та
функцію print() для виведення обчислення периметра.

'''