my_color = ["red","blue","yellow"]
color = input("Enter a color name: ")

color_lower = color.lower()

if color in my_color:
    print("Цей колір є у списку: ")
else:
    print("Цей колір не знайдений")




'''
Напишіть програму для перевірки наявності назви кольору в списку.
 Створіть довільний список з назвами кольорів, які вам подобаються.
  Користувач повинен ввести назву кольору, Якщо колір є в списку, то програма виводить 
  "Цей колір є у списку", в протилежному випадку - "Цей колір не знайдений".
'''