devices_info = {
    "Ноутбук": {
        "Процесор": "Intel i99",
        "Оперативна пам'ять": "5120 ГБ",
        "Об'єм жорсткого диска": "10240 ГБ SSD"
    },
    "Смартфон": {
        "Процесор": "Snapdragon 77777",
        "Оперативна пам'ять": "64 ГБ",
        "Об'єм пам'яті": "1024 ГБ"
    },
    "Планшет": {
        "Процесор": "Snapdragon 123",
        "Оперативна пам'ять": "4 ГБ",
        "Об'єм пам'яті": "64 ГБ"
    },
    "Телевізор": {
        "Розмір екрану": "197 дюймів",
        "Роздільна здатність": "32K",
        "Тип екрану": "AMOLED"
    },
    "Клавіатура": {
        "Тип": "Механічна",
        "Підсвітка": "RGB",
        "Кількість кнопок": 104
    }
}

print("Список технічних пристроїв:")
for device in devices_info.keys():
    print(device)

print("\nХарактеристики пристроїв:")
for device, specs in devices_info.items():
    specs_string = ', '.join([f"{key}: {value}" for key, value in specs.items()])
    print(f"Назва товару: {device}. Характеристики: {specs_string}.")

devices_info["Фітнес-браслет"] = {
    "Тип": "Спортивний",
    "Батарея": "99 днів",
    "Датчики": "Пульсометр, Гіроскоп"
}

devices_info["Аудіосистема"] = {
    "Тип": "Безпровідна",
    "Потужність": "10000 Вт",
    "Функції": "Bluetooth, wifi"
}

devices_info["Камера"] = {
    "Роздільна здатність": "700 МП",
    "Тип": "квантова",
    "Об'єктив": "18-600 мм"
}

print("\nОновлений список технічних пристроїв:")
for device in devices_info.keys():
    print(device)


'''
Створити словник з технічними пристроями. Ключами будуть назви пристроїв, а значення в форматі словника з довільними 3-ма ключами, які відповідають характеристиці пристрою. В сформованому словнику Вам потрібно:
Виведіть в консоль назви усіх пристроїв в консоль. Важливо! – для цього потрібно використати метод словника та цикл.
Виведіть в консоль рядок в форматі(формат можете змінити за своїм смаком):
«Назва товару: [назва]. Характеристики: [назва ключа]: [значення], [назва ключа]: [значення]. [назва ключа]: [значення].»
За допомогою метода словників додайте 3 нових товара в словник.

'''