my_list = [10,5,971,12,52]
my_list.extend([15, 20, 25])
print("Додаємо 3 значення:", my_list)
new_list = [50, 30, 40]
my_list.extend(new_list)
print("Після додавання нового списку:", my_list)
my_list.sort()
print("Відсортований список:", my_list)


'''
Створіть список з довільними п’ятьма значеннями. За допомогою методів списків виконайте наступні дії:
1. Додайте в кінець список три довільних значення.
2. Створіть новий список і додайте його в кінець існуючого списку.
3. Відсортуйте новостворений список, та видаліть по індексу 1, 3 та 7 значення.
Всі результати виведіть в консоль.

'''
'''first_list = [10,5,971,12,52]

new_list = [10,23,12]

last_add_list = first_list + [23,998,17]
add_list = last_add_list + new_list
sorted_list = sorted(add_list)

print("Список з доданими 3 значеннямми в кінець: ",last_add_list)
print("Існуючий список з доданим новим в кінець існуючого: ",add_list)
print("Відсортований список: ",sorted_list)

'''