# Введення трьох значень
num_1 = input("Введіть перше число: ")
num_2 = input("Введіть друге число: ")
num_3 = input("Введіть третє число: ")
numbers = []

for num in [num_1, num_2, num_3]:
    if num.lstrip('-').replace('.', '', 1).isdigit():  # Перевіряємо, чи число дійсне
        if '.' in num:
            numbers.append(float(num))
        else:
            numbers.append(int(num))
    else:
        print(f"{num} не є числом, пропускаємо")

if len(numbers) > 0:
    average = sum(numbers) / len(numbers)

    if average > 50:
        print("Середнє більше за 50")
    elif average < 50:
        print("Середнє менше за 50")
    else:
        print("Середнє дорівнює 50")
else:
    print("Немає жодного дійсного числа для розрахунку середнього арийметричного чилса")

'''
Напишіть програму, в яку користувач вводить три числа. Спочатку виконайте перевірки, 
чи введене значення є числом(int чи float). Якщо якесь з цих значень не є числом, 
то виведіть, яке саме число введено неправильно.
	Після цього програма має порахувати середнє значення цих чисел і виводить:
Якщо середнє значення більше за 50 - вивести "Середнє більше за 50".
Якщо середнє значення менше за 50 - вивести "Середнє менше за 50".
Якщо середнє значення дорівнює 50 - вивести "Середнє дорівнює 50".

'''