full_name = input("Enter your full name (ім'я, по батькові, прізвище): ")

full_name_end = full_name.strip()

formatted_name = full_name_end.title()

print("Повне ім'я: ",formatted_name)
last_name = formatted_name.split()[-1]
is_female = last_name.endswith('а')

print("Прізвище закінчується на літеру 'а' :",is_female)



'''
Завдання 5.
Створіть програму, яка запитує повне ім'я користувача (ім'я, по батькові, прізвище) та виконує такі дії:
Видаляє зайві пробіли на початку та в кінці;
Приводить усі слова до правильного формату (велика літера на початку кожного слова);
Перевіряє, чи прізвище закінчується на літеру 'а' (для жіночих прізвищ).

'''