name = input("Введіть ваше ім'я: ")
email = input("Введіть вашу електронну пошту: ")
age = input("Введіть ваш вік: ")\

info = []

if not name:
    info.append(1) # error
else:
    info.append(0) # норм

if int(age) <= 18:
    info.append(1)
else:
    info.append(0)

if "@" not in email:
    info.append(1)
else:
    info.append(0)

if sum(info) == 0:
    print("Дані коректні")
else:
    if info[0] == 1:
        print("Ім'я не може бути порожнім")
    if info[1] == 1:
        print("Невірний вік")
    if info[2] == 1:
        print("Невірний формат email")





'''
    if not name:
        print("Ім'я не може бути порожнім")
    elif age <= 18:
        print("Невірний вік")
    el
        print("Невірний формат email")
    else:
        print("Дані коректні")





Напишіть програму, в якій користувач вводить імʼя, електронну пошту та свій вік. 
Якщо ім'я не пусте і вік більше за 18 і email містить символ "@", вивести "Дані коректні". 
Якщо одна з умов не виконується — вивести відповідне повідомлення про помилку (наприклад,
 "Ім'я не може бути порожнім", "Невірний вік", "Невірний формат email"). 

'''