genre = input("Введіть жанр (бойовик, комедія, мультфільм): ").lower()
age = int(input("Введіть ваш вік: "))

movies = {
    "бойовик": ["Месники", "Термінатор", "Форсаж"],
    "комедія": ["Маска", "Один вдома", "Суперсемейка"],
    "мультфільм": ["Король Лев", "Холодне серце", "Шрек"]
}

age_restrictions = {
    "бойовик": 16,
    "комедія": 12,
    "мультфільм": 0
}

if genre in movies:
    if age >= age_restrictions[genre]:
        print(f"Рекомендовані фільми у жанрі {genre.capitalize()}:")
        for movie in movies[genre]:
            print(f"- {movie}")
    else:
        print(f"Жанр '{genre.capitalize()}' має вікове обмеження. Ви можете переглядати фільми з {age_restrictions[genre]} років.")
else:
    print("Введений жанр недоступний. Будь ласка, виберіть з наступних: бойовик, комедія, мультфільм.")

'''
Напишіть програму, яка може допомогти користувачу вибрати фільм для перегляду.
Користувач вводить жанр та вік, і відповідно від жанру програма пропонує фільми на перегляд.
 Жанри можуть бути на Ваш вибір, наприклад: "бойовик", "комедія", "мультфільм".
  Всю інформацію про фільми ви повинні зберігати в списках, і вже в відповіді редагувати
  їх за допомогою форматування рядків.
'''