login = "user"
password = "12345"

login_input = input("Введіть логін: ")
password_input = input("Введіть пароль: ")
info = []

if login == login_input:
    info.append(0)
else:
    info.append(3)
if password == password_input:
    info.append(0)
else:
    info.append(1)

if sum(info) == 0:
    print("Успішний вхід")
else:
    if sum(info) == 1:
        print("Невірний пароль")
    if sum(info) >= 3:
        print("Невірний логін")



'''
Напишіть програму, яка перевіряє  правильність логіну і пароля. 
Створи змінні з правильним логіном і паролем (наприклад, login = "user", password = "12345").
 Користувач вводить логін і пароль. Виконайте наступні перевірки:
Якщо логін і пароль співпадають із правильними — вивести "Успішний вхід".
Якщо логін правильний, але пароль неправильний — вивести "Невірний пароль".
Якщо логін неправильний або логін і пароль неправильні — вивести "Невірний логін".

'''