from multiprocessing.util import is_exiting

age = input("Enter your age: ")
annual_income = input("Enter your annual income: ")
credit_history = input("Enter your credit history 'good' or 'bad': ")

info = []

if int(age) >= 21:
    info.append(0)
else:
    info.append(1)
if int(annual_income) > 50000:
    info.append(0)
else:
    info.append(1)
if credit_history == "good":
    info.append(0)
else:
    info.append(1)

if sum(info) == 0:
    print("Кредит схвалено")
else:
    # Відхилення кредиту, якщо дохід більше 50,000, але погана кредитна історія або вік менше 21
    if info[1] == 0 and (info[0] == 1 or info[2] == 1):
        print("Кредит відхилено: річний дохід більше 50,000, але вік менше 21 року або погана кредитна історія.")
    else:
        print("Кредит відхилено через:")
        if info[0] == 1:
            print("- недостатній вік")
        if info[1] == 1:
            print("- недостатній дохід")
        if info[2] == 1:
            print("- погану кредитну історію")


'''
Напишіть програму для банку, яка перевіряє, чи може користувач отримати кредит. 
Запитай у користувача його вік, річний дохід і кредитну історію (добра або погана). 
Виконайте наступні перевірки:

Якщо користувачу більше 21 року і річний дохід більше 50,000 і кредитна історія добра — вивести "Кредит схвалено".
Якщо річний дохід більше 50,000, але кредитна історія погана або користувачу менше 21 року —
 вивести "Кредит відхилено через кредитну історію або вік".
Якщо всі умови не виконуються — вивести "Кредит відхилено".

'''