"""
Напишіть функцію descending_order, яка може приймати в якості аргументу будь-яке
 невід'ємне ціле число і повертати його цифрами у порядку спадання. По суті, переставити
  цифри так, щоб отримати максимально можливе число.
Перевірте, чи переданий аргумент є цілим і невідʼмним числом та виведіть помилку, якщо
 переданий аргумент не відповідає вказаним вимогам.
"""


def descending_order(n):
    if not isinstance(n, int) or n < 0:
        raise ValueError("Аргумент повинен бути невід'ємним цілим числом.")

    return int("".join(sorted(str(n), reverse=True)))



try:
    user_input = int(input("Введіть невід'ємне ціле число: "))
    print("Результат:", descending_order(user_input))
except ValueError as e:
    print("Помилка:", e)