"""
Напишіть функцію descending_order, яка може приймати в якості аргументу будь-яке
 невід'ємне ціле число і повертати його цифрами у порядку спадання. По суті, переставити
  цифри так, щоб отримати максимально можливе число.
Перевірте, чи переданий аргумент є цілим і невідʼмним числом та виведіть помилку, якщо
 переданий аргумент не відповідає вказаним вимогам.
"""


def descending_order(num):
    try:
        num = int(num)
        if num < 0:
            return "Число має бути невід'ємним"
        return int("".join(sorted(str(num), reverse=True)))
    except ValueError:
        return "Некоректне введення. Введіть числове значення."


user_input = int(input("Введіть невід'ємне ціле число: "))
print("Результат:", descending_order(user_input))